load_tests/tsung-script-2.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="debug">

<!-- Total number of requests by all users in all sessions : 38250 -->

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="whogoesthere5.3zzyfjeguw.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

<!-- Total 2550 sessions -->

  <load>
    <arrivalphase phase="1" duration="10" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

<!-- Total requests: 15 -->
<!-- Total thinktime: 0 -->

  <sessions>
    <session name="overload_database" probability="100" type="ts_http">
      
      <transaction name="setup">

        <request>
          <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match>
          <dyn_variable name="authenticity_token"/>
          <http url='/users/new.html'></http>
        </request>

        <!-- Grab and format authenticity token -->
        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
          <var name="authenticity_token"/>
        </setdynvars>

        <!-- Set the user id -->
        <setdynvars sourcetype="erlang" callback="ts_user_server:get_unique_id">
          <var name="user_id" />
        </setdynvars>

        <!-- Set the number of users in the database -->
        <setdynvars sourcetype="value" value="100">
          <var name="total_num_users" />
        </setdynvars>

      </transaction>

      <transaction name="test">

        <!-- Fetch all my events -->
        <!-- Grab the first and last event ids -->
        <request subst="true">
          <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match>
          <dyn_variable name="first_event_id" re='"id\":(.*),\"name\":\"first'/>
          <dyn_variable name="last_event_id" re='"id\":(.{1,30}),\"name\":\"last_event'/>
          <http url='/users/%%_user_id%%/events'></http>
        </request>

        <thinktime value="2" random="true"></thinktime>

        <!-- Loop through all my events and choose a subset to invite people to -->
        <!-- For each event in my subset, choose a subset of people to invite -->
        <for from="%%_first_event_id%%" to="%%_last_event_id%%" incr="1" var="event_num">
          <setdynvars sourcetype="random_number" start="0" end="1" >
            <var name="event_probability" />
          </setdynvars>
          <if var="event_probability" eq="1">
            <request subst="true">
              <http url='/events/%%_event_num%%'></http>
            </request>
            <for from="1" to="%%_total_num_users%%" var="user_num">
              <setdynvars sourcetype="random_number" start="0" end="1" >
                <var name="invite_probability" />
              </setdynvars>
              <if var="invite_probability" eq="1">
                <thinktime value="5" random="true"></thinktime>
                <request subst="true">
                  <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match>
                  <http url='/events/%%_event_num%%/invitations'></http>
                </request>
                <request subst="true">
                  <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match>
                  <http url='/events/%%_event_num%%/invitations' contents="authenticity_token=%%_authenticity_token%%&amp;invitation%5Buser_id%5D=%%_user_num%%" method='POST'></http>
                </request>
              </if>
            </for>
            <setdynvars sourcetype="random_number" start="0" end="1" >
              <var name="comment_probability" />
            </setdynvars>
            <if var="comment_probability" eq="1">
              <thinktime value="5" random="true"></thinktime>
              <request subst="true">
                <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match>
                <http url='/events/%%_event_num%%/comments'></http>
              </request>
              <request subst="true">
                <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match>
                <http url='/events/%%_event_num%%/comments' contents="authenticity_token=%%_authenticity_token%%&amp;comment%5Buser_id%5D=%%_user_id%%&amp;comment%5Bbody%5D=message" method='POST'></http>
              </request>
              <request subst="true">
                <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match>
                <http url='/events/%%_event_num%%/comments'></http>
              </request>
            </if>
          </if>
        </for>

        <!-- Create up to five new events -->
        <setdynvars sourcetype="random_number" start="0" end="1" >
          <var name="create_event_probability" />
        </setdynvars>
        <for from="1" to="5" incr="1" var="new_event_num">
          <if var="create_event_probability" eq="1">
            <thinktime value="10" random="true"></thinktime>
            <request subst="true">
              <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match>
              <dyn_variable name="created_event_id" re='"id\":(.*),\"name\":\"Yoga'/> 
              <http url='/users/%%_user_id%%/events' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;event%5Buser_id%5D=%%_user_id%%&amp;event%5Bname%5D=Yoga&amp;event%5Bdescription%5D=Downdawg&amp;event%5Blocation%5D=Park&amp;event%5Bstart_time(1i)%5D=2019&amp;event%5Bstart_time(2i)%5D=11&amp;event%5Bstart_time(3i)%5D=12&amp;event%5Bstart_time(4i)%5D=23&amp;event%5Bstart_time(5i)%5D=24&amp;event%5Bend_time(1i)%5D=2019&amp;event%5Bend_time(2i)%5D=11&amp;event%5Bend_time(3i)%5D=12&amp;event%5Bend_time(4i)%5D=23&amp;event%5Bend_time(5i)%5D=24" method='POST'></http>
            </request>
            <request subst="true">
              <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match>
              <http url='/users/%%_user_id%%/events'></http>
            </request>
          </if>
        </for>

        <thinktime value="2" random="true"></thinktime>

        <!-- Fetch all my invitations -->
        <request subst="true">
          <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match>
          <http url='/users/%%_user_id%%/invitations'></http>
        </request>

        <!-- RSVP to certain invitations 
        <request subst="true">
          <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match>
          <http url='/events/%%_event_num%%/invitations' contents="authenticity_token=%%_authenticity_token%%&amp;invitation%5Bresponse%5D=yes" method='PUT'></http>
        </request> -->

      </transaction>

    </session>
  </sessions>
</tsung>